app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2009-06-09 01:11:34', '3515c83247344afbadebe0c79b43d938ca0748c6d06da8d03dd7cfd8a3d7747ec1a39609e13f2fc52397b95ea737c00fd6ac846375c5c999bf2adcabb21de6e3', 'frankbardon', 'k8x0nMQpONxr_ayWvJQ6', '7805116d1ac223e16aace18cb539888c8a97c9f3ebe26ac397255948c0b6e2e963fa5c85661f64ce91e02f209e3e2af57e700bcaae6cd7da721067b6adcf5a6b', 'frankbardon@gmail.com', '2009-06-09 01:11:34')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "email" = 'frankbardon@gmail.coms', "updated_at" = '2009-06-09 01:33:29' WHERE "id" = 2
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])